{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing implemented UI features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base and utility layers plus OKLCH-based CSS variables defining light and dark theme tokens.",
  "frontend/index.html": "HTML entry point providing root div and loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React component wrapping the app in a ThemeProvider and rendering header, registration flow, and footer.",
  "frontend/src/components/layout/AppShell.tsx": "Simple layout wrapper providing a centered max-width container.",
  "frontend/src/components/registration/StepHeader.tsx": "Visual step header showing progress indicators and titles for the registration flow.",
  "frontend/src/components/ThemeSwitcher.tsx": "Theme switcher UI offering light/dark toggle and theme selection via dropdown.",
  "frontend/src/features/registration/RegistrationFlow.tsx": "Controls navigation through registration steps and manages shared registration data state.",
  "frontend/src/features/registration/types.ts": "Type definitions for registration form data and validation errors.",
  "frontend/src/features/registration/validation.ts": "Client-side validation logic for registration fields plus a helper to check overall validity.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance based on authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity authentication, including login, logout, and loading stored identities. Wraps AuthClient with custom options and exposes state and helpers via a hook.",
  "frontend/src/index.css": "Tailwind base, components, and utilities with custom CSS variables for light/dark themes and typography utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Confirmation.tsx": "Displays a confirmation screen after successful exam registration with next steps and a reset button.",
  "frontend/src/pages/ExamSelection.tsx": "Provides a UI to choose an exam from mock options, highlighting the selection and allowing navigation forward or back.",
  "frontend/src/pages/LandingStart.tsx": "Landing page describing the registration steps and offering a button to start the process.",
  "frontend/src/pages/RegistrationDetails.tsx": "Form page for entering student and exam session details with validation, tracking touched fields, and submitting when valid.",
  "frontend/src/pages/Review.tsx": "React page showing a summary of registration data and exam details with confirm/back actions.",
  "frontend/src/theme/ThemeProvider.tsx": "Provides a context-driven theme system allowing theme and mode selection with persistence.",
  "frontend/src/theme/themes.ts": "Defines multiple color-theme configurations with light/dark palettes for the UI.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and enabling theme-driven CSS variables.",
  "project_state.json": "Project metadata describing scope, features, design requirements, and current progress for the UI draft."
}